Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.ShortDimensionTypes Enumeration
 The position of the short dimension value.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ShortDimensionTypes
Public Enumeration ShortDimensionTypes
Members
Member name | Value | Description
Inside | 0 |  The dimension value is set between the dimension lines when the dimension is too short.
Outside | 1 |  The dimension value is moved outside of the dimension when the dimension is too short.
See Also
Reference
Tekla.Structures.Drawing Namespace